tsoome/illumos-gate/usr/src/man/man1m/in.tftpd.1m
.\"
.\" Copyright 1989 AT&T
.\" Copyright (C) 2008, Sun Microsystems, Inc. All Rights Reserved
.\" Copyright 2015 Nexenta Systems, Inc. All rights reserved.
.\" The contents of this file are subject to the terms of the Common Development and Distribution License (the "License").  You may not use this file except in compliance with the License.
.\" You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE or http://www.opensolaris.org/os/licensing.  See the License for the specific language governing permissions and limitations under the License.
.\" When distributing Covered Code, include this CDDL HEADER in each file and include the License file at usr/src/OPENSOLARIS.LICENSE.  If applicable, add the following below this CDDL HEADER, with the fields enclosed by brackets "[]" replaced with your own identifying information: Portions Copyright [yyyy] [name of copyright owner]
.\" Copyright 2021 Toomas Soome <tsoome@me.com>
.Dd June 26, 2021
.Dt IN.TFTPD 1M
.Os
.Sh NAME
.Nm in.tftpd ,
.Nm tftpd
.Nd Internet Trivial File Transfer Protocol server
.Sh SYNOPSIS
.Nm in.tftpd
.Op Fl d
.Op Fl T Ar rexmtval
.Op Fl s
.Op Ar homedir
.Sh DESCRIPTION
.Nm
is a server that supports the Internet Trivial File Transfer Protocol (TFTP).
.sp
Before responding to a request, the server attempts to change its current
directory to
.Ar homedir ;
the default directory is
.Pa /tftpboot .
.sp
The use of
.Sy tftp does not require an account or password on the remote system.
Due to the lack of authentication information,
.Nm
will allow only publicly readable files to be accessed.
Files may be written only if they already exist and are publicly writable.
Note that this extends the concept of "public" to include all users on all
hosts that can be reached through the network.
This may not be appropriate on all systems, and its implications should be
considered before enabling this service.
.sp
.Nm
runs with the user
.Sy ID
and group
.Sy ID
set to
.Sy [GU]ID_NOBODY
under the assumption that no files exist with that owner or group.
However, nothing checks this assumption or enforces this restriction.
.Sh OPTIONS
.Bl -tag -width "-T rexmtval"
.It Fl d
Debug.
When specified it sets the
.Sy SO_DEBUG
socket option.
.It Fl s
Secure.
When specified, the directory change to
.Ar homedir
must succeed.
The daemon also changes its root directory to
.Ar homedir .
.It Op T Ar rexmtval
Specifies the value of the retransmission timeout in seconds.
This also affects the maximum session timeout in that the latter is set to
five times the retransmission timeout value.
.El
.Sh USAGE
The
.Nm
server is IPv6-enabled.
See
.Xr ip6 7P .
.Nm
supports transfers of greater than 32 MB, per RFC 2348.
.Sh SEE ALSO
.Xr svcs 1 ,
.Xr tftp 1 ,
.Xr inetadm 1M ,
.Xr inetd 1M ,
.Xr svcadm 1M ,
.Xr netconfig 4 ,
.Xr attributes 5 ,
.Xr smf 5 ,
.Xr ip6 7P
.Rs
.%A Malkin, G.
.%A Harkin, A.
.%T RFC 2347: TFTP Option Extension
.%I The Internet Society
.%D May 1998
.Re
.Rs
.%A Malkin, G.
.%A Harkin, A.
.%T RFC 2348: TFTP Blocksize Option
.%I The Internet Society
.%D May 1998
.Re
.Rs
.%A Malkin, G.
.%A Harkin, A.
.%T RFC 2349: TFTP Timeout Interval and Transfer Size Options
.%I The Internet Society
.%D May 1998
.Re
.Rs
.%A Sollins, K.R.
.%T RFC 1350: The TFTP Protocol (Revision 2)
.%I Network Working Group
.%D July 1992
.Re
.Rs
.%A Patric Masotta Serva
.%T RFC 7440, TFTP Windowsize Option
.%I Internet Engineering Task Force
.%D January 2015
.Re
.Sh NOTES
The
.Nm
server only acknowledges the transfer size option that is sent
with a
.Sy read
request when the octet transfer mode is specified.
.sp
The
.Nm
service is managed by the service management facility,
.Xr smf 5 ,
under the service identifier:
.Bd -literal
svc:/network/tftp/udp6:default
.Ed
.sp
Administrative actions on this service, such as enabling, disabling, or
requesting restart, can be performed using
.Xr svcadm 1M .
Responsibility for initiating and restarting this service is delegated to
.Xr inetd 1M .
Use
.Xr inetadm 1M
to make configuration changes and to view configuration information for this
service.
The service's status can be queried using the
.Xr svcs 1
command.
